using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CarRace
{
    class GameSetting
    {
        // player ------------------------------------------------------------

        public char[] FigurePlayerCar = new char[] { '0', '/', 'A', '\\', '0',
                                                     '|', '|', 'H', '|', '|',
                                                     '|', '[', '_', ']', '|',
                                                     '0', '-', '-', '+', '0',
        };

        public byte XCoordinatePlayerCar = 23;
        public sbyte YCoordinatePlayerCar = 35;

        // FastCarEnemy ------------------------------------------------------

        public char[] FigureFastCarEnemy = new char[] { '0', '^', '-', '-', '0',
                                                        '|', '[', '~', ']', '|',
                                                        '0', '\\', '_', '/', '0',
                                                        '\\', 'V', '_', 'V', '/',
        };

        public sbyte YCoordinateFastCarEnemy = -4;

        // CarEnemy ----------------------------------------------------------
                                                                                  
        public char[] FigureCarEnemy = new char[] { '0', '^', '-', '-', '0',        
                                                    '|', '|', 'H', '|', '|',  
                                                    '|', '\\', '_', '/', '|', 
                                                    '0', '<', '_', '>', '0', 
        }; 
                                                                                        
        public sbyte YCoordinateCarEnemy = -4;
    }
}
// ||~ 0^--0
// ||~ ||H||
// ||~ |\_/|
// ||~ 0<_>0

// ||~ 0/A\0
// ||~ ||H||
// ||~ |[_]|
// ||~ 0--+0

// ||~ 0^--0
// ||~ |[~]|
// ||~ 0\_/0
// ||~ \V_V/


/*
 * 
 * 
 * 
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~          SS        |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~       0/A\0                            ~||
||~       ||H||                            ~||
||~       |[_]|        |                   ~||
||~       0--+0                            ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
||~                    |                   ~||
||~                                        ~||
||~                                        ~||
ПППППППППППППППППППППППППППППППППППППППППППППП
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */

